# Algoritmo - Tratamento BD (Billhetagem, GPS e GTFS)
### Autor: Antônio Claudio Dutra Batista
### Orientador: Francisco Moraes de Oliveria Neto
### Metodologia: Adequação de formatos e conscistência

# 1.0  Leitura das Bases e tratamento

# 1.1 Bilhetagem (Tratamento Inicial)

In [1]:
import pandas as pd 
# Arquivos são do mês de novembro de 2018.
# Definindo tipos de variaveis com tamanhos menores
tipos_specification = {'id': 'int32', 'linha': 'int32'}

# df's abaixo (leitura somente das colunas necessárias):
dia_01 = pd.read_csv('2018-11-01.csv', dtype=tipos_specification, sep= ',')
dia_02 = pd.read_csv('2018-11-02.csv', dtype=tipos_specification, sep= ',')
dia_03 = pd.read_csv('2018-11-03.csv', dtype=tipos_specification, sep= ',')
dia_04 = pd.read_csv('2018-11-04.csv', dtype=tipos_specification, sep= ',')
dia_05 = pd.read_csv('2018-11-05.csv', dtype=tipos_specification, sep= ',') 
dia_06 = pd.read_csv('2018-11-06.csv', dtype=tipos_specification, sep= ',')
dia_07 = pd.read_csv('2018-11-07.csv', dtype=tipos_specification, sep= ',')
dia_08 = pd.read_csv('2018-11-08.csv', dtype=tipos_specification, sep= ',')
dia_09 = pd.read_csv('2018-11-09.csv', dtype=tipos_specification, sep= ',')
dia_10 = pd.read_csv('2018-11-10.csv', dtype=tipos_specification, sep= ',')

# Continuando...
dia_11 = pd.read_csv('2018-11-11.csv', dtype=tipos_specification, sep= ',')
dia_12 = pd.read_csv('2018-11-12.csv', dtype=tipos_specification, sep= ',')
dia_13 = pd.read_csv('2018-11-13.csv', dtype=tipos_specification, sep= ',')
dia_14 = pd.read_csv('2018-11-14.csv', dtype=tipos_specification, sep= ',')
dia_15 = pd.read_csv('2018-11-15.csv', dtype=tipos_specification, sep= ',')
dia_16 = pd.read_csv('2018-11-16.csv', dtype=tipos_specification, sep= ',')
dia_17 = pd.read_csv('2018-11-17.csv', dtype=tipos_specification, sep= ',')
dia_18 = pd.read_csv('2018-11-18.csv', dtype=tipos_specification, sep= ',')
dia_19 = pd.read_csv('2018-11-19.csv', dtype=tipos_specification, sep= ',')
dia_20 = pd.read_csv('2018-11-20.csv', dtype=tipos_specification, sep= ',')

# Continuando...
dia_21 = pd.read_csv('2018-11-21.csv', dtype=tipos_specification,  sep= ',')
dia_22 = pd.read_csv('2018-11-22.csv', dtype=tipos_specification,  sep= ',')
dia_23 = pd.read_csv('2018-11-23.csv', dtype=tipos_specification,  sep= ',')
dia_24 = pd.read_csv('2018-11-24.csv', dtype=tipos_specification,  sep= ',')
dia_25 = pd.read_csv('2018-11-25.csv', dtype=tipos_specification,  sep= ',')
dia_26 = pd.read_csv('2018-11-26.csv', dtype=tipos_specification,  sep= ',')
dia_27 = pd.read_csv('2018-11-27.csv', dtype=tipos_specification,  sep= ',')
dia_28 = pd.read_csv('2018-11-28.csv', dtype=tipos_specification,  sep= ',')
dia_29 = pd.read_csv('2018-11-29.csv', dtype=tipos_specification,  sep= ',')
dia_30 = pd.read_csv('2018-11-30.csv', dtype=tipos_specification,  sep= ',')

C:\Users\Bolsista\AppData\Local\Temp\ipykernel_6492\2908415636.py:16: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  dia_10 = pd.read_csv('2018-11-10.csv', dtype=tipos_specification, sep= ',')

In [2]:
# Agrupando (10 dias)
dia_01_10 = pd.concat([dia_01, dia_02, dia_03, dia_04, dia_05, dia_06 ,dia_07, dia_08, dia_09, dia_10])

# Continuando...
dia_11_20 = pd.concat([dia_11, dia_12, dia_13, dia_14, dia_15,dia_16, dia_17, dia_18, dia_19, dia_20])

# Continuando...
dia_21_30 = pd.concat([dia_21, dia_22, dia_23, dia_24, dia_25, dia_26, dia_27, dia_28, dia_29, dia_30])

mes_tudo = pd.concat([dia_01_10, dia_11_20,dia_21_30])

In [3]:
# DELETANDO EXPLICITAMENTE VARAIVEIS COM DIAS 01-10
del dia_01
del dia_02
del dia_03
del dia_04
del dia_05
del dia_06
del dia_07
del dia_08
del dia_09
del dia_10

# DELETANDO EXPLICITAMENTE VARAIVEIS COM DIAS 11-20
del dia_11
del dia_12
del dia_13
del dia_14
del dia_15
del dia_16
del dia_17
del dia_18
del dia_19
del dia_20

# DELETANDO EXPLICITAMENTE VARAIVEIS COM DIAS 21-30
del dia_21
del dia_22
del dia_23
del dia_24
del dia_25
del dia_26
del dia_27
del dia_28
del dia_29
del dia_30

# DELETANDO EXPLICITAMENTE VARAIVEIS COM DIAS 1agrupados
del dia_01_10
del dia_11_20
del dia_21_30

In [4]:
# Base com dados do mes em um unico arquivo
mes_tudo

,id,linha,nome_linha,prefixo_carro,hora,tipo_cartao,nome_cartao,sentido_viagem,integracao,dia,momento
0,7407715,21,Luc. Cavalca./Papicu,2018.0,2018-11-01T23:57:37Z,Vale transporte,04-VALE TRANSPORTE,Volta,N,2018-11-01,23:57:37
1,4526990,21,Luc. Cavalca./Papicu,2018.0,2018-11-02T00:01:25Z,Vale transporte,04-VALE TRANSPORTE,Volta,N,2018-11-02,00:01:25
2,6084812,21,Luc. Cavalca./Papicu,2018.0,2018-11-01T22:45:20Z,Vale transporte,04-VALE TRANSPORTE,Ida,N,2018-11-01,22:45:20
3,7341826,21,Luc. Cavalca./Papicu,2018.0,2018-11-01T22:45:36Z,Vale transporte,04-VALE TRANSPORTE,Ida,N,2018-11-01,22:45:36
4,7261888,21,Luc. Cavalca./Papicu,2018.0,2018-11-01T22:52:44Z,Vale transporte,04-VALE TRANSPORTE,Ida,N,2018-11-01,22:52:44
...,...,...,...,...,...,...,...,...,...,...,...
929953,0,114,Cj Nova Assuncao/Fra,21710.0,2018-11-30T05:54:09Z,Inteira,Inteira,Ida,N,2018-11-30,05:54:09
929954,0,114,Cj Nova Assuncao/Fra,21710.0,2018-11-30T05:54:35Z,Inteira,Inteira,Ida,N,2018-11-30,05:54:35
929955,0,114,Cj Nova Assuncao/Fra,21710.0,2018-11-30T05:59:20Z,Inteira,Inteira,Ida,N,2018-11-30,05:59:20
929956,0,114,Cj Nova Assuncao/Fra,21710.0,2018-11-30T06:04:11Z,Inteira,Inteira,Ida,N,2018-11-30,06:04:11
929957,0,114,Cj Nova Assuncao/Fra,21710.0,2018-11-30T05:17:14Z,Inteira,Inteira,Volta,N,2018-11-30,05:17:14

In [5]:
# Info da base 
mes_tudo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24919015 entries, 0 to 929957
Data columns (total 11 columns):
 #   Column          Dtype
---  ------          -----
 0   id              int32
 1   linha           int32
 2   nome_linha      object
 3   prefixo_carro   object
 4   hora            object
 5   tipo_cartao     object
 6   nome_cartao     object
 7   sentido_viagem  object
 8   integracao      object
 9   dia             object
 10  momento         object
dtypes: int32(2), object(9)
memory usage: 2.0+ GB

In [6]:
# Juntando colunas de interesse (dia, momento) em uma só:
mes_tudo["momento"] = mes_tudo['dia'].astype(str) + '-' + mes_tudo['momento'].astype(str)

In [7]:
# Dados da coluna tipo_cartao
mes_tudo["tipo_cartao"].unique()

array(['Vale transporte', 'Estudante', 'Gratuidade', 'Inteira'],
      dtype=object)

In [8]:
# Dados da coluna nome_cartao
mes_tudo["nome_cartao"].unique()

array(['04-VALE TRANSPORTE', '11-ESTUDANTE COM DEBITO',
       '12-VALE-TRANPORTE AVULSO', '03-GRATUIDADE IDOSO',
       '02-ESTUDANTE ETUFOR', 'GRAT. DEFICIENTE - C/ACOMP',
       'GRAT. DEFICIENTE - S/ACOMP', 'GRATUIDADE IDENTIFIC. ETUFOR',
       'Inteira', 'PAGANTE EM HORARIO DIFERENCIADO'], dtype=object)

In [9]:
# REMOVENDO COLUNAS DESNECESSÁRIAS!
mes_tudo.drop(['tipo_cartao', 'hora', 'dia'], inplace= True, axis=1)

In [10]:
# Verificando dados nulos 
mes_tudo.isnull().sum()

id                    0
linha                 0
nome_linha          906
prefixo_carro     27239
nome_cartao           0
sentido_viagem        0
integracao            0
momento               0
dtype: int64

In [58]:
# Base 'PREVIAMENTE' tratrada do mes 
mes_tudo

,id,linha,nome_linha,prefixo_carro,nome_cartao,sentido_viagem,integracao,momento
0,7407715,21,Luc. Cavalca./Papicu,2018.0,04-VALE TRANSPORTE,Volta,N,2018-11-01-23:57:37
1,4526990,21,Luc. Cavalca./Papicu,2018.0,04-VALE TRANSPORTE,Volta,N,2018-11-02-00:01:25
2,6084812,21,Luc. Cavalca./Papicu,2018.0,04-VALE TRANSPORTE,Ida,N,2018-11-01-22:45:20
3,7341826,21,Luc. Cavalca./Papicu,2018.0,04-VALE TRANSPORTE,Ida,N,2018-11-01-22:45:36
4,7261888,21,Luc. Cavalca./Papicu,2018.0,04-VALE TRANSPORTE,Ida,N,2018-11-01-22:52:44
...,...,...,...,...,...,...,...,...
929953,0,114,Cj Nova Assuncao/Fra,21710.0,Inteira,Ida,N,2018-11-30-05:54:09
929954,0,114,Cj Nova Assuncao/Fra,21710.0,Inteira,Ida,N,2018-11-30-05:54:35
929955,0,114,Cj Nova Assuncao/Fra,21710.0,Inteira,Ida,N,2018-11-30-05:59:20
929956,0,114,Cj Nova Assuncao/Fra,21710.0,Inteira,Ida,N,2018-11-30-06:04:11
929957,0,114,Cj Nova Assuncao/Fra,21710.0,Inteira,Volta,N,2018-11-30-05:17:14

In [12]:
# mes_tudo.to_csv('bilhetagem_tratada_112018')

# 1.2 Dicionário

## 1.2.1 Tratamento inicial

In [13]:
# df', abaixo:
d1 = pd.read_csv('veiculos2018.csv', sep= ';')

In [14]:
# Base bruta
d1

      id_veiculo cod_veiculo
0          42095      20274M
1          42080       20957
2          41971       26815
3          41970       26821
4          41969       26819
...          ...         ...
2036       32033       36006
2037       32032       36004
2038       32031       36003
2039       32030       36002
2040       32029       36001

[2041 rows x 2 columns]

In [15]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2041 entries, 0 to 2040
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_veiculo   2041 non-null   int64
 1   cod_veiculo  2041 non-null   object
dtypes: int64(1), object(1)
memory usage: 32.0+ KB

In [16]:
# Dados nulos
d1.isnull().sum()

id_veiculo     0
cod_veiculo    0
dtype: int64

In [17]:
d1[d1['cod_veiculo'].str.contains('2018')]

      id_veiculo cod_veiculo
143        40957      20181V
281        39094      20180V
1374       32965       20181
1378       32961       20180
1934       32174       02018

In [18]:
''' SERÃO REMOVIDOS OS CARACTERS DE CADA LINHADOS DADOS DA COLUNA COD_VEICULO PARA COMPARAÇÃO NO TOPICO 1.1.2 ! '''

' SERÃO REMOVIDOS OS CARACTERS DE CADA LINHADOS DADOS DA COLUNA COD_VEICULO PARA COMPARAÇÃO NO TOPICO 1.1.2 ! '

In [19]:
# Convertendo dados para tipo caracters
d1['cod_veiculo'] = d1['cod_veiculo'].astype('str')

In [20]:
# Removendo caracteres da coluna de cod_veiculo
d1['cod_veiculo'] = d1['cod_veiculo'].replace({'\D': ''}, regex=True)

In [21]:
# Dados nulos apos remoção dos caracters
d1.isnull().sum()

id_veiculo     0
cod_veiculo    0
dtype: int64

In [22]:
# Dropando linhas que estão com cod_veiculo vazias, ou seja, todas informação contida era catacters
d1 = d1[d1['cod_veiculo']!=""]

In [23]:
d1

      id_veiculo cod_veiculo
0          42095       20274
1          42080       20957
2          41971       26815
3          41970       26821
4          41969       26819
...          ...         ...
2036       32033       36006
2037       32032       36004
2038       32031       36003
2039       32030       36002
2040       32029       36001

[1989 rows x 2 columns]

## 1.2.2 Verificação de dados do dicionario presentes no GPS e Bilhetagem

### 1.2.2.1 GPS (Tratamento inicial)

In [24]:
# leitura do base - GPS

import pandas as pd

# Definindo o número de linhas que você deseja ler
numero_de_linhas_para_ler = 45000000  # Substitua pelo número desejado
dtype_specification = {'longitude': 'float32', 'latitude': 'float32', 'vehicle_vehicleid': 'int32'}

# Usando o pandas para ler o CSV, limitando o número de linhas com a opção nrows
mes_ate_45_milhoes = pd.read_csv('Paint112018.csv',usecols=['latitude', 'longitude', 'metrictimestamp', 'vehicle_vehicleid'], dtype=dtype_specification, nrows=numero_de_linhas_para_ler)

In [25]:
# Lendo restante do arquivo
mes_resto = pd.read_csv('Paint112018.csv', usecols=['latitude', 'longitude','metrictimestamp', 'vehicle_vehicleid'],dtype=dtype_specification, skiprows=range(1, numero_de_linhas_para_ler + 1))

In [26]:
# Juntando em um mesmo df
GPS_I_H =  pd.concat([mes_ate_45_milhoes, mes_resto])

In [27]:
# Excluindo explicitamente variavel com dados do GPS separados
del mes_ate_45_milhoes
del mes_resto

In [28]:
display(GPS_I_H.iloc[275])

latitude            -3.725625e+00
longitude           -3.855716e+01
metrictimestamp      2.018120e+13
vehicle_vehicleid    3.909400e+04
Name: 275, dtype: float64

In [29]:
GPS_I_H.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 109792980 entries, 0 to 64792979
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   latitude           float32
 1   longitude          float32
 2   metrictimestamp    int64
 3   vehicle_vehicleid  int32
dtypes: float32(2), int32(1), int64(1)
memory usage: 2.9 GB

In [30]:
# FORMATANDO metrictimestamp do (GPS)
GPS_I_H['momento'] = pd.to_datetime(GPS_I_H['metrictimestamp'],format= '%Y%m%d%H%M%S')

In [31]:
GPS_I_H.drop("metrictimestamp", axis= 1, inplace= True)

In [32]:
# Renomear coluna de momento de vehicle_vehicleid para id_veiculo:
GPS_I_H.columns=['latitude', 'longitude','id_veiculo', 'momento']

In [33]:
# Colocando valores em ordem
GPS_I_H.sort_values('momento', inplace= True)

In [45]:
GPS_I_H[GPS_I_H.id_veiculo==39100]

          latitude  longitude  id_veiculo             momento
30704433 -3.721691 -38.559261       39100 2018-11-01 03:00:01
30699594 -3.721691 -38.559261       39100 2018-11-01 03:00:06
30696693 -3.721691 -38.559261       39100 2018-11-01 03:00:10
30695619 -3.721600 -38.559254       39100 2018-11-01 03:00:15
30695016 -3.721600 -38.559254       39100 2018-11-01 03:00:20
...            ...        ...         ...                 ...
64792452 -3.725433 -38.560394       39100 2018-12-01 02:59:35
64792585 -3.725430 -38.560364       39100 2018-12-01 02:59:41
64792669 -3.725436 -38.560341       39100 2018-12-01 02:59:45
64792798 -3.725408 -38.560356       39100 2018-12-01 02:59:51
64792892 -3.725386 -38.560368       39100 2018-12-01 02:59:56

[372936 rows x 4 columns]

In [46]:
GPS_I_H[GPS_I_H.id_veiculo==33263]

          latitude  longitude  id_veiculo             momento
49058505 -3.725156 -38.557289       33263 2018-11-01 03:00:29
49057565 -3.725156 -38.557289       33263 2018-11-01 03:01:12
49055791 -3.725156 -38.557289       33263 2018-11-01 03:02:01
49055793 -3.725156 -38.557289       33263 2018-11-01 03:02:01
49050447 -3.725156 -38.557289       33263 2018-11-01 03:02:13
...            ...        ...         ...                 ...
64789899 -3.725328 -38.560478       33263 2018-12-01 02:54:04
64789898 -3.725328 -38.560478       33263 2018-12-01 02:54:04
64789950 -3.725328 -38.560467       33263 2018-12-01 02:55:02
64789949 -3.725328 -38.560467       33263 2018-12-01 02:55:02
64789951 -3.725328 -38.560467       33263 2018-12-01 02:55:02

[46210 rows x 4 columns]

In [34]:
''' APOS TRATAMENTO INICIAL DA BASE É POSSIVEL COMPARAÇÃO COM OS DADOS DO DICIONARIO'''

' APOS TRATAMENTO INICIAL DA BASE É POSSIVEL COMPARAÇÃO COM OS DADOS DO DICIONARIO'

### 1.2.2.2 Verificação dados do dicionario presentes no GPS
''' Identificando somente os dados do dicinario que estão presentes no GPS! '''

In [35]:
# Filtrando que estão no dicionario e estão no GPS
dados_em_d1_GPS = d1[d1['id_veiculo'].isin(GPS_I_H['id_veiculo'])]

In [36]:
dados_em_d1_GPS.reset_index(inplace=True)
dados_em_d1_GPS.drop(columns=['index'], inplace=True)

C:\Users\Bolsista\AppData\Local\Temp\ipykernel_6492\1036990158.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dados_em_d1_GPS.drop(columns=['index'], inplace=True)

In [37]:
# Base dos dados do dicionario que possuem correspondentes no GPS
dados_em_d1_GPS

      id_veiculo cod_veiculo
0          39632       35861
1          39620       12820
2          39592       30119
3          39576       36212
4          39512       21727
...          ...         ...
1761       32033       36006
1762       32032       36004
1763       32031       36003
1764       32030       36002
1765       32029       36001

[1766 rows x 2 columns]

In [38]:
# visualizando DUPLICADOS 
dados_em_d1_GPS[dados_em_d1_GPS['cod_veiculo'].duplicated(keep=False)]

      id_veiculo cod_veiculo
21         39377       20961
36         39241          01
37         39240          02
56         39108       20287
59         39100       20964
61         39098       20066
62         39097       20173
63         39096       20961
64         39095       20224
65         39094       20180
122        37400           2
123        37399           1
124        37398          02
174        35601          01
899        33263       20964
1096       33022           1
1097       33021           2
1104       32988       20287
1110       32972       20224
1118       32961       20180
1129       32949       20173
1147       32930       20066

In [39]:
''' Para um banco de dados e uma possivel mesclagem não é necessário dados que não serão relacionados, portanto não serão mesclados! ou seja, é necessário outra abordagem! '''

' Para um banco de dados e uma possivel mesclagem não é necessário dados que não serão relacionados, portanto não serão mesclados! ou seja, é necessário outra abordagem! '

### 1.2.2.3 Verificação dados do dicionario presentes na Bilhetagem
''' Identificando somente os dados do dicinario que estão presentes no Bilhetagem! isso apos identificação dos dados que tambem posssuem correspondentes no GPS! '''

In [40]:
# Filtrando que estão no dicionario e estão na bilhetagem
dados_em_d1_GPS_bilhetagem = dados_em_d1_GPS[dados_em_d1_GPS['cod_veiculo'].isin(mes_tudo['prefixo_carro'])]

In [41]:
dados_em_d1_GPS_bilhetagem

      id_veiculo cod_veiculo
0          39632       35861
1          39620       12820
2          39592       30119
4          39512       21727
6          39510       35735
...          ...         ...
1759       32035       36008
1761       32033       36006
1762       32032       36004
1763       32031       36003
1765       32029       36001

[1134 rows x 2 columns]

In [42]:
# visualizando DUPLICADOS 
dados_em_d1_GPS_bilhetagem[dados_em_d1_GPS_bilhetagem['cod_veiculo'].duplicated(keep=False)]

      id_veiculo cod_veiculo
59         39100       20964
64         39095       20224
899        33263       20964
1110       32972       20224

In [43]:
''' APOS, ESSE TRATAMENTO, A BASE "dados_em_d1_GPS_bilhetagem" POSSUI DADOS QUE ESTÃO NA BILHETAGEM E QUE ESTÃO NA BASE DO DICIONARIO E POSSUEM UM CORRESPONDENTE NA BASE DO GPS! '''

' APOS, ESSE TRATAMENTO, A BASE "dados_em_d1_GPS_bilhetagem" POSSUI DADOS QUE ESTÃO NA BILHETAGEM E QUE ESTÃO NA BASE DO DICIONARIO E POSSUEM UM CORRESPONDENTE NA BASE DO GPS! '

In [57]:
''' CONTUDO, APRESENTA AINDA DOIS ID'S DE VEICULOS COM DADOS DUPLICADOS DE IDENTIFICAÇÃO NA BILHETAGEM E QUE POSSUE REGISTROS NO GPS (COM IDENTIFICAÇÃO PROPRIA), EM UMA POSSIVEL MESCLAGEM, ISSO NÃO LEVA A ACORRENCIA DE ERRO DA LOCALIZAÇÃO DO USUARIO, POIS MESMO TENDO UMA IDENTIFAÇÃO IGUAL DA BILHETAGEM, ELA POSSUE IDENTIFICAÇÃO DIFERENTE NO GPS E ESSA JUNÇÃO LEVA EM CONSIDERAÇÃO O CRITERIO DE TEMPO! MAS NA PRIMERIA MESCLAGEM TERÃO DUAS ASSOCIAÇÕES DE UM USUARIO COM ESSES DOIS VEICULO NO DICIONARIO, QUE LEVA A OCORRENCIA DE DADOS DUPLICADOS DO USUARIO E DE LOCALIZAÇÃO EM DOIS VEICULOS DIFERENTES! '''

" CONTUDO, APRESENTA AINDA DOIS ID'S DE VEICULOS COM DADOS DUPLICADOS DE IDENTIFICAÇÃO NA BILHETAGEM E QUE POSSUE REGISTROS NO GPS (COM IDENTIFICAÇÃO PROPRIA), EM UMA POSSIVEL MESCLAGEM, ISSO NÃO LEVA A ACORRENCIA DE ERRO DA LOCALIZAÇÃO DO USUARIO, POIS MESMO TENDO UMA IDENTIFAÇÃO IGUAL DA BILHETAGEM, ELA POSSUE IDENTIFICAÇÃO DIFERENTE NO GPS E ESSA JUNÇÃO LEVA EM CONSIDERAÇÃO O CRITERIO DE TEMPO! MAS NA PRIMERIA MESCLAGEM TERÃO DUAS ASSOCIAÇÕES DE UM USUARIO COM ESSES DOIS VEICULO NO DICIONARIO, QUE LEVA A OCORRENCIA DE DADOS DUPLICADOS DO USUARIO E DE LOCALIZAÇÃO EM DOIS VEICULOS DIFERENTES! "

In [55]:
''' MAS PARA UM RELACIONAMENTO EM UM BANCO DE DADOS RELACIONAL DE MUITOS PARA MUITOS É NECESSÁRIO QUE A TERCEIRA TABELA QUE RELACIONA AS DEMAIS SEJA COM DADOS UNICOS! '''

' MAS PARA UM RELACIONAMENTO EM UM BANCO DE DADOS RELACIONAL DE MUITOS PARA MUITOS É NECESSÁRIO QUE A TERCEIRA TABELA QUE RELACIONA AS DEMAIS SEJA COM DADOS UNICOS! '

### 1.2.2.4 Adequação...
''' ! '''

# 1.3 GPS
''' Base ja teve adequação do formato dos dados '''

## 1.3.1 Inspeção inicial

# ------------------------------------------------------------------------